grammar = {
'2-2-1-2': [
    # 森罗/仪卫/振/华缨
    # 皇图/大业/超/前古
    "n n vt n",
    # 暮云/朝雨/长/相见
    "n n d vi",
    # 细香/明艳/尽/天与
    "n n d a/n-v",
    # 长空/黯淡/连/芳草
    # 凤楼/郁郁/呈/嘉瑞
    "n a vt n",
    # 花光/媚春/醉/琼楼
    # 琵琶/闲抱/理/相思
    "n vi vt n",
    # 江南/依旧/称/佳丽
    "n d vt n",
    # 吴姬/个个/是/神仙
    "n ? v n",
    # 多情/自古/伤/离别
    "n ? vt n"
    # 弱柳/困宫/腰/低亚
    "n vi/v-n n vi",
    # 葭苇/萧萧/风/淅淅
    # 宿妆/稀淡/眉/成字
    # 日色/欲尽/花/含烟
    "n a n a",
    "n vi n vi",
    # 浊酒/一杯/家/万里
    "n m n m",
    # 梨花/一枝/春/带雨
    "n m n a"
    # 良辰/可惜/虚/抛掷
    "n vi? d vi",
    # 屏山/楼外/青/无数
    "n sb n m"
    # 小楼/昨夜/又/东风
    "n t c/vt n"
    # 晚岁/光阴/能/几许
    "t n aux wm"?
    # 朋落/乌啼/霜/满天
    "n-vi n-vi n a/vi",
    # 帘垂/深院/冷/萧萧
    "n-vt n n a",
    "n-vt n a d",
    # 莺解/新声/蝶/解舞
    # 山映/斜阳/天/接水
    "n-vt n n v-n",
    # 苹满/汀洲/人/未归
    "n-vt s n vi/z",
    # 利牵/名惹/逡/巡过
    "n-vi n-vi n vi/v-n"
    # 遥望/碧天/净/如扫
    "vt n a d?",
    # 独教/冷落/向/秋天
    "vt? n p n",
    # 未容/浓翠/伴/桃红
    "vt? n vt n",
    # 留取/丹心/照/汗青
    "vt? n vt n",
    # 倚楼/无语/欲/销魂
    "vi/v-n vi/z d vi",
    # 持杯/谢酒/朋/诗侣
    "vi vi vt n"
    "v-n v-n vt n"
    # 最难/欢聚/易/离别
    "d vi d vi",
    "a n a n",
    # 宫中/旦暮/听/潮声
    # 别来/尘土/污/人衣
    "t n vt n",
    # 别来/锦字/终/难偶
    "t n d a",
    # 门前/岁岁/生/灵草
    # 渭南/往岁/忆/来游
    "s t vt n",
    # 庙前/江水/怒/为涛
    "s n n p-n",
    "s n d v-n/vi",
    # 端门/羽卫/簇/雕阑
    "s n vt n",
    # 尊前/只恐/伤/郎意
    "s d vt n",
    # 池长/凭阑/愁/无侣
    "s vi/v-t vt z",
    # 剑岭/云横/控/西夏
    "s n-vi vt n",
    # 占尽/风情/向/小园
    "vt n p n",
    # 莫道/千金/酬/一笑
    "vt n vt n",
    # 来疑/沧海/尽/成空
    "vt n d v-n/vi",
    # 星斗/分明/在/身畔
    "n d p s",
    # 纷纷/堕叶/飘/香砌
    "a n vt n",
    "a n v s",
    # 分明/夜色/如/晴昼
    "a n v n",
    # 九枝/擎烛/灿/繁星
    # 三千/珠翠/拥/宸游
    # 两竿/红日/上/花梢
    "m n v/a n",
    # 几多/狎客/看/无厌
    "m n vi vb?",
    # 心娘/自小/能/歌舞
    "r p-t? aux vi",
    # 何妨/携手/同/归去
    "??? vi c vi",
    # 疑似/银河/落/九天
    "??? n v n/s"
    # 似屏/如障/堪/游玩
    "a? a? aux vi"
],

}

